---
kind: other
id: Methods.T:Autodesk.Revit.DB.ViewSetIterator
source: html/deb24b81-477a-648e-7721-939871214242.htm
---
# ViewSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.